from classes.names_processor import GreekNameProcessor


def main():
    listOfGreekNames = [
        "Αβεσαλώμ", "Αγγαίος", "Αθανάσιος", "Αιμίλιος", "Αλκιβιάδης", "Ανδρόνικος", "Αντίοχος", "Αρχέλαος", 
        "Αρκάδιος", "Αρτέμιος", "Ασκληπιός", "Αυγουστίνος", "Βελισσάριος", "Βησσαρίων", "Βλάσιος", "Γαβριήλ", 
        "Γεράσιμος", "Γρηγόριος", "Δαμιανός", "Δοσίθεος", "Δομήνικος", "Δωρόθεος", "Ελπιδοφόρος", "Ευγένιος", 
        "Ευθύμιος", "Ζαφείριος", "Ησαΐας", "Ησύχιος", "Θεοδόσιος", "Θεοφάνης", "Θωμάς", "Ιάκωβος", "Ιερεμίας", 
        "Ιλαρίων", "Κλεάνθης", "Κοσμάς", "Λαυρέντιος", "Λεόντιος", "Λουκάς", "Μακαριστός", "Ματθαίος", "Μενέλαος", 
        "Μιλτιάδης", "Νεόφυτος", "Νικόλαος", "Ορέστης", "Παγκράτιος", "Παντελεήμων", "Πατρίκιος", "Πελοπίδας", 
        "Περεγρίνος", "Πορφύριος", "Προκόπιος", "Ραδάμανθυς", "Σαμψών", "Σέργιος", "Σεραφείμ", "Σιλουανός", 
        "Σοφρώνιος", "Σπυρίδων", "Σταυρίνος", "Συμεών", "Τιμόθεος", "Τιμόλαος", "Τίτος", "Τρύφων", "Τιβέριος", 
        "Φαίδων", "Φανούριος", "Φειδίας", "Φιλάρετος", "Φιλήμων", "Φραγκίσκος", "Φυλλίδας", "Χαράλαμπος", 
        "Χριστόδουλος", "Χρυσόστομος", "Ψαμιανός", "Ωρίων", "Άγναρος", "Άγριος", "Αμβρόσιος", "Αναξαγόρας", 
        "Αρχιμήδης", "Αλφρέδος", "Βατοπαιδινός", "Βαρνάβας", "Βηρυττός", "Γεώργιος", "Γλυκέριος", "Ευάγγελος", 
        "Ευμένης", "Ζωτικός", "Ηρακλείδης", "Ιάσονας", "Κωνσταντίνος", "Λεόν", "Περικλής", "Σωφρόνιος", "Τερέντιος", 
        "Υπατίων", "Ωκεανός"
    ]

    # Initialize the processor
    processor = GreekNameProcessor()

    # Process the names
    processed_names = processor.process_names(listOfGreekNames)

    # Print the results
    for message in processed_names:
        print(message)
    
    # Process a single name
    name = "Λάζαρος"
    processed_name = processor.process_name(name)
    print(f"Processed name '{name}': {processed_name}")

if __name__ == "__main__":
    main()

